{
    "Positive": [
        "# 400 Fictional Positive Financial News Cases for Stock Market Sentiment Training",
        "## Sentiment Range: 0.70-1.00 (Positive to Very Positive)",
        "### News Cases 1-50: Earnings Beats & Revenue Growth",
        "**TechVision Corp announces Q4 earnings of $2.45 per share, beating analyst estimates by 23% withrevenue growth of 34% year-over-year.** (Sentiment: 0.92)",
        "**GlobalRetail Inc reports record quarterly revenue of $8.7 billion, surpassing expectations by $1.2 billion driven by strong e-commerce sales.** (Sentiment: 0.89)",
        "**BioPharma Solutions exceeds earnings forecasts with EPS of $3.12, representing 45% growth and announces accelerated drug pipeline development.** (Sentiment: 0.94)",
        "**Quantum Computing Systems posts surprise profit of $428 million in Q3, reversing previous losses and demonstrating clear path to sustained profitability.** (Sentiment: 0.91)",
        "**Green Energy Dynamics reports 67% revenue increase to $2.3 billion with operating margins expanding to 28%, well above industry average.** (Sentiment: 0.88)",
        "**CloudSoft Technologies announces blockbuster quarter with 156% year-over-year subscriber growth and raised full-year guidance by 30%.** (Sentiment: 0.95)",
        "**MediDevice Innovations beats earnings by $0.87 per share with revenue of $1.9 billion, up 41% from la st year's quarter.** (Sentiment: 0.87)",
        "**AutoElectric Manufacturing reports stellar Q2 results with 52% margin improvement and production capacity doubled ahead of schedule.** (Sentiment: 0.90)",
        "**FinanceHub Digital posts earnings of $4.23 per share versus $3.10 expected, citing strong customer acquisition and retention rates.** (Sentiment: 0.86)",
        "**SpaceLogistics International exceeds revenue projections by 38% with $3.4 billion in quarterly sales and expanding backlog of $12 billion.** (Sentiment: 0.93)",
        "**NanoMaterials Corp delivers exceptional Q1 performance with 73% revenue growth and gross margins improving to 61%.** (Sentiment: 0.89)",
        "**StreamMedia Entertainment reports subscriber additions of 8.4 million, crushing estimates of 4.2 million with reduced churn rate.** (Sentiment: 0.91)",
        "**CyberSecurity Dynamics announces record revenue of $987 million, beating forecasts by 29% with 82% recurring revenue base.** (Sentiment: 0.88)",
        "**RoboticSystems Inc posts quarterly earnings 56% above consensus with operating leverage improving across all business segments.** (Sentiment: 0.90)",
        "**AgriTech Solutions reports bumper harvest results with revenue up 44% and successful expansion into 15 new international markets.** (Sentiment: 0.85)",
        "**DataAnalytics Global exceeds expectations with $2.78 EPS on revenue of $5.6 billion, demonstrating strong enterprise adoption.** (Sentiment: 0.87)",
        "**HealthWear Technologies posts 89% year-over-year growth with 12.3 million devices sold and expanding healthcare partnerships.** (Sentiment: 0.92)",
        "**SolarPanel Innovations announces record quarter with revenue of $4.2 billion, up 58% with backlog extending through 2026.** (Sentiment: 0.90)",
        "**SmartHome Systems delivers outstanding results with 67% revenue growth and customer satisfaction scores reaching all-time highs.** (Sentiment: 0.86)",
        "**BioTech Therapeutics beats estimates by wide margin with $1.95 EPS versus $1.20 expected and three drugs advancing to Phase III.** (Sentiment: 0.94)",
        "**CloudInfrastructure Partners reports remarkable 112% revenue growth with enterprise customer count tripling year-over-year.** (Sentiment: 0.93)",
        "**ElectricVehicle Components posts surprise quarterly profit of $234 million with gross margins expanding to 35% from 22%.** (Sentiment: 0.89)",
        "**DigitalPayments Network announces exceptional quarter with transaction volume up 78% and take rates improving.** (Sentiment: 0.88)",
        "**Semiconductor Advanced posts earnings beat of 41% with capacity utilization at 98% and pricing power strengthening.** (Sentiment: 0.91)",
        "**TeleHealth Connect reports 134% revenue growth with 2.8 million active providers and expanding insurance partnerships.** (Sentiment: 0.90)",
        "**FoodDelivery Express exceeds expectations with order growth of 67% and path to profitability accelerated by two quarters.** (Sentiment: 0.87)",
        "**Gaming Platforms Inc announces blockbuster results with monthly active users up 94% and in-game monetization improving.** (Sentiment: 0.89)",
        "**Enterprise Software Solutions beats revenue forecasts by $890 million with 96% customer retention rate and expanding deal sizes.** (Sentiment: 0.88)",
        "**Battery Technology Corp reports breakthrough quarter with revenue of $3.8 billion, up 71% with new factory ramping faster than expected.** (Sentiment: 0.92)",
        "**Wireless Infrastructure posts exceptional results with tower lease revenue up 43% and 5G upgrades driving margin expansion.** (Sentiment: 0.85)",
        "**ArtificialIntelligence Labs announces stellar performance with commercial deployments up 156% and partnership revenue tripling.** (Sentiment: 0.93)",
        "**OceanShipping Logistics beats earnings by $1.45 per share with utilization rates at record 96% and pricing environment strong.** (Sentiment: 0.87)",
        "**LuxuryRetail Brands reports same-store sales growth of 38% with international expansion exceeding projections in all regions.** (Sentiment: 0.86)",
        "**ProteinAlternatives Inc posts revenue growth of 189% with retail presence expanding to 45,000 locations nationwide.** ("
    ],
    "Neutral": [
        "# Neutral Financial News Dataset for Stock Market Sentiment Analysis",
        "**Sentiment Range: 0.45-0.55 (Neutral)**",
        "**For Sci-kit Learn Training - Fictional Companies**",
        "---",
        "### 1-50: Quarterly Earnings Reports (Mixed Results)",
        "TechFlow Industries reported Q3 earnings of $1.23 per share, matching analyst expectations of $1.23, with revenue coming in at $4.2 billion.",
        "Global Retail Partners announced quarterly revenue of $850 million, a slight increase from last year's $847 million, meeting most analyst forecasts.",
        "Meridian Financial Services posted earnings that were in line with estimates, reporting $0.89 EPS against the expected $0.90.",
        "Cascade Manufacturing released Q2 results showing flat year-over-year growth at $2.1 billion in revenue.",
        "Vertex Consumer Goods reported mixed quarterly results with revenue beating by 2% but earnings missing by 1%.",
        "Horizon Pharmaceuticals announced earnings per share of $2.15, exactly matching the consensus estimate from analysts.",
        "Summit Energy Solutions disclosed quarterly performance that met expectations, with modest growth in key segments offset by declines in others.",
        "Pinnacle Technologies reported revenue of $3.8 billion, up 3% year-over-year, in line with industry growth rates.",
        "Bridgepoint Logistics announced Q1 results that showed stable operating margins at 12.5%, unchanged from the previous quarter.",
        "Nexus Communications released earnings guidance for next quarter that neither exceeded nor fell short of current analyst expectations.",
        "Silverline Aerospace posted quarterly earnings that reflected ongoing market conditions, with no major surprises either way.",
        "Quantum Systems Inc. reported revenue growth of 4%, matching the broader sector average for the quarter.",
        "Crestview Hospitality Group announced occupancy rates remained steady at 68%, consistent with seasonal patterns.",
        "Atlas Industrial Supply disclosed quarterly earnings that were essentially flat compared to the same period last year.",
        "Evergreen Chemicals reported operating income of $245 million, within the expected range of $240-250 million.",
        "Pacific Basin Trading announced quarterly results that reflected mixed performance across different geographic regions.",
        "Metropolitan Insurance Group posted underwriting results that were consistent with actuarial projections.",
        "Cornerstone Automotive reported market share remained stable at 8.3% for the quarter.",
        "Frontier Telecommunications disclosed subscriber growth of 1.2%, matching the industry median.",
        "Redwood Materials Co. announced quarterly cash flow from operations of $180 million, meeting internal targets.",
        "Skyline Healthcare Services reported patient volume metrics that were in line with seasonal expectations.",
        "Landmark Real Estate Trust disclosed occupancy rates across its portfolio remained at 91%, unchanged quarter-over-quarter.",
        "Precision Instruments Corp. announced order backlog of $1.8 billion, consistent with historical averages.",
        "Gateway Entertainment Group reported streaming subscriber additions that matched guidance provided last quarter.",
        "Cobalt Mining International disclosed production volumes that were in line with operational forecasts.",
        "Sterling Pharmaceuticals announced clinical trial results that met primary endpoints but showed no unexpected benefits.",
        "Titan Construction Group reported project wins totaling $420 million, replacing completed projects at approximately the same rate.",
        "Clearwater Utilities posted residential customer growth of 0.8%, consistent with population growth in service areas.",
        "Omega Software Solutions announced renewal rates of 87%, matching historical patterns for the company.",
        "Highland Agriculture Inc. reported crop yields that were consistent with USDA regional averages.",
        "Coastal Shipping Lines disclosed freight volumes that tracked overall economic activity with no notable deviations.",
        "Zenith Media Group announced advertising revenue that reflected broader market trends without outperforming or underperforming.",
        "Midland Bancorp reported loan growth of 3.2%, in line with regional banking sector averages.",
        "Apex Biotechnology disclosed research spending increased to 18% of revenue, matching company guidance.",
        "Continental Packaging Solutions announced capacity utilization rates remained at 78%, a typical level for the industry.",
        "Trident Defense Systems reported contract awards that maintained the company's existing revenue run rate.",
        "Velocity E-commerce Platforms disclosed transaction volumes grew in proportion to overall online retail expansion.",
        "Northstar Investment Management announced assets under management of $42 billion, up 2% due primarily to market appreciation.",
        "Eclipse Semiconductor reported book-to-bill ratio of 1.0, indicating orders matched shipments for the quarter.",
        "Providence Medical Devices announced regulatory submissions progressing according to expected timelines.",
        "Anchor Marine Services reported utilization rates for its fleet at 72%, typical for this time of year.",
        "Summit Beverage Corporation disclosed market share data showing positions held steady across key categories.",
        "Granite Financial Technologies announced system uptime of 99.7%, meeting service level agreements.",
        "Monarch Textiles Group reported inventory levels at 45 days of sales, within normal operating parameters.",
        "Cascade Renewable Energy disclosed power generation that matched weather-adjusted forecasts.",
        "Ridgeline Mining Corp. announced exploration spending maintained at 12% of revenue as previously guided.",
        "Harbor Freight Solutions reported on-time delivery performance of 94%, consistent with company standards.",
        "Spectrum Diagnostics Group disclosed test volumes increased 5%, matching healthcare utilization trends.",
        "Mesa Electronics Manufacturing announced yield rates remained at 96%, showing stable production quality.",
        "Crescent Hotel Group reported revenue per available room figures that were in line with competitive set averages.",
        "---",
        "### 51-100: Product Launches and Business Developments",
        "Innovate Consumer Electronics announced the launch of its new tablet device, priced competitively with similar products in the market.",
        "Apex Automotive revealed plans to introduce a mid-range sedan model to complement its existing lineup.",
        "Nexgen Appliances disclosed a refresh of its refrigerator line with incremental feature improvements.",
        "Fusion Foods Corporation announced expansion of its frozen meal offerings into three additional regional markets.",
        "Velocity Sportswear launched a new running shoe line positioned in the mid-price segment.",
        "Quantum Furniture Group introduced an office furniture collection targeting small to medium businesses.",
        "Meridian Cosmetics announced a limited edition product line with standard pricing and distribution.",
        "Cascade Tools Inc. disclosed plans to add several SKUs to its power tool range over the next quarter.",
        "Summit Gaming Technologies revealed development of a new"
    ],
    "Negative": [
        "# 400 Realistic Negative Financial News Cases for Stock Market Sentiment Training",
        "### Sentiment Rating: 0.00-0.30 (Highly Negative)",
        "---",
        "## Cases 1-50: Bankruptcy & Insolvency News",
        "**TechVision Corp announces Chapter 11 bankruptcy filing after losing $2.3 billion in annual revenue, stock plummets 87% in after-hours trading.**",
        "**GlobalRetail Inc. faces imminent bankruptcy as creditors reject restructuring plan, leaving $4.5 billion in unsecured debt.**",
        "**PharmaCure Solutions files for bankruptcy protection following failed drug trials and $1.8 billion lawsuit settlement.**",
        "**AutoMotive Dynamics declares insolvency after missing bond payments for third consecutive quarter, assets to be liquidated.**",
        "**EnergyFirst Holdings enters bankruptcy proceedings with $6.2 billion debt burden and no viable restructuring path.**",
        "**CloudTech Systems files Chapter 7 liquidation, shareholders expected to receive nothing as liabilities exceed assets by $900 million.**",
        "**MegaConstruct Inc. announces bankruptcy after corruption scandal leads to cancellation of $3.4 billion in government contracts.**",
        "**BioGenesis Pharma seeks bankruptcy protection as FDA rejects flagship drug, wiping out $2.1 billion in projected revenue.**",
        "**FinanceHub Corp declares insolvency following massive fraud discovery, $5.7 billion in client funds missing.**",
        "**RetailChain America files for bankruptcy, plans to close all 847 stores nationwide, eliminating 34,000 jobs.**",
        "**AeroSpace Innovations enters Chapter 11 after major contract termination leaves company with $3.9 billion debt.**",
        "**DataSecure Technologies faces liquidation as ransomware attack costs exceed insurance coverage by $1.2 billion.**",
        "**GreenEnergy Solutions files bankruptcy petition after government subsidies eliminated, projects become unviable.**",
        "**MediSupply Corp. announces insolvency following recalls affecting 83% of product line and $2.6 billion in liabilities.**",
        "**TeleComm Global declares bankruptcy as 5G infrastructure investment of $4.8 billion fails to generate returns.**",
        "**FoodService Enterprises files Chapter 11 with $2.4 billion debt after foodborne illness outbreak affects 12,000 customers.**",
        "**SoftwareSolutions Inc. enters bankruptcy protection as cyberattack exposes customer data, leading to $1.9 billion in lawsuits.**",
        "**IndustrialManufacturing Corp seeks liquidation, pension fund shortfall of $3.7 billion leaves retirees vulnerable.**",
        "**ChemicalProcessing Ltd. files for bankruptcy after environmental disaster results in $5.1 billion cleanup liability.**",
        "**TransportLogistics Inc. declares insolvency, unable to service $2.8 billion debt amid fuel cost surge.**",
        "**SmartDevice Technologies announces Chapter 7 filing after product defects lead to global recall of $1.6 billion.**",
        "**PropertyDevelopment Group files bankruptcy with $7.3 billion in commercial real estate exposure as market collapses.**",
        "**HealthCare Systems Corp. enters insolvency proceedings, $4.2 billion Medicare fraud investigation underway.**",
        "**EntertainmentMedia Inc. files for bankruptcy protection after streaming platform loses 8.7 million subscribers.**",
        "**AgricultureTech Solutions declares bankruptcy following crop failure affecting $2.9 billion in projected revenue.**",
        "**MiningResources Global announces liquidation as commodity prices crash, $6.8 billion in stranded assets.**",
        "**ConsumerElectronics Corp. files Chapter 11 after catastrophic battery failures spark $3.3 billion in recalls.**",
        "**FinTechPayments Inc. seeks bankruptcy protection following regulatory shutdown and $1.5 billion in frozen assets.**",
        "**HospitalityChain Worldwide declares insolvency, pandemic losses exceed $4.6 billion with no recovery path.**",
        "**SemiconductorTech Ltd. files for bankruptcy as chip shortage costs $2.7 billion and major customers defect.**",
        "**CleanWater Systems enters Chapter 7 liquidation after contamination scandal results in $3.8 billion liability.**",
        "**VirtualReality Innovations announces bankruptcy, failed product launch loses $1.4 billion investor capital.**",
        "**PackagingCorp America files for insolvency with $5.4 billion debt as raw material costs surge 340%.**",
        "**RenewableEnergy Group declares bankruptcy after wind farm projects fail, $2.2 billion investment lost.**",
        "**TelehealthServices Inc. seeks bankruptcy protection, insurance reimbursement issues create $1.9 billion gap.**",
        "**ApplianceManufacturing Corp. files Chapter 11 following supply chain collapse and $3.1 billion in backorders.**",
        "**SocialMedia Ventures announces liquidation as platform shutdown leads to $4.9 billion advertiser exodus.**",
        "**PetroleumRefining Inc. declares insolvency, crude price volatility results in $6.5 billion hedging losses.**",
        "**FashionRetail Brands files for bankruptcy, store closures affect 520 locations and eliminate 18,000 jobs.**",
        "**BiotechResearch Corp. enters Chapter 7 after clinical trial fatalities halt operations, $2.3 billion liability.**",
        "**UrbanTransit Systems announces bankruptcy following derailment incident, $4.7 billion in injury claims.**",
        "**CyberSecurity Defenders files for insolvency after breach affects 47 million users, reputation destroyed.**",
        "**SmartHome Technologies declares bankruptcy, IoT device vulnerabilities lead to $1.8 billion class action.**",
        "**CommercialAviation Services seeks Chapter 11 protection with $5.9 billion debt and grounded fleet.**",
        "**PharmaceuticalDistribution Inc. files bankruptcy after opioid litigation settlement of $7.2 billion approved.**",
        "**SolarPanel Manufacturers announces liquidation, Chinese competition drives losses of $3.6 billion.**",
        "**CloudStorage Enterprises declares insolvency following data center fire, $2.1 billion in customer losses.**",
        "**AutomotiveSupply Chain files for bankruptcy as EV transition strands $4.3 billion in obsolete inventory"
    ]
}